// http status codes

module.exports = {
  defaults: {
    unknown: {
      error: 'Невідомий статус',
      desc: 'Йой, навіть й гадки не маємо призначення даного статусу. Можливо він не реалізований.',
    },
    '4xx': {
      error: 'Невідома помилка',
      desc: 'Йой, навіть й гадки не маємо що це за помилка.'
    },
    '5xx': {
      error: 'Невідома помилка',
      desc: 'Йой, навіть й гадки не маємо що це за помилка.'
    },
  },

  // 1xx Інформаційні

  100: {
    error: 'Continue',
    desc: 'Початкова частина запиту отримана і ще не відхилена сервером.',
  },
  101: {
    error: 'Switching Protocols',
    desc: 'Клієнт попросив сервер змінити протокол, і сервер погодився це зробити.',
  },
  102: {
    error: 'Processing',
    desc: 'Сервер отримав і обробляє запит, але відповідь ще недоступна.',
  },
  103: {
    error: 'Early Hints',
    desc: 'Використовується для повернення деяких заголовків відповіді перед остаточним HTTP-повідомленням.',
  },

  // 2xx Успіх

  200: {
    error: 'OK',
    desc: 'Запит успішно виконано.',
  },
  201: {
    error: 'Created',
    desc: 'Запит виконано, створено новий ресурс.',
  },
  202: {
    error: 'Accepted',
    desc: 'Запит прийнято для обробки, але обробка ще не завершена.',
  },
  203: {
    error: 'Non-Authoritative Information',
    desc: 'Сервер успішно обробив запит, але повертає інформацію, яка може бути з іншого джерела.',
  },
  204: {
    error: 'No Content',
    desc: 'Сервер успішно обробив запит, але не повертає жодного контенту.',
  },
  205: {
    error: 'Reset Content',
    desc: 'Сервер успішно обробив запит, не повертає контент і вимагає скидання виду документа.',
  },
  206: {
    error: 'Partial Content',
    desc: 'Сервер передає лише частину ресурсу через заголовок діапазону, надісланий клієнтом.',
  },
  207: {
    error: 'Multi-Status',
    desc: 'Тіло повідомлення містить XML, який може містити кілька окремих кодів відповіді.',
  },
  208: {
    error: 'Already Reported',
    desc: 'Члени DAV-зв’язування вже були перераховані у попередній відповіді на цей запит.',
  },
  226: {
    error: 'IM Used',
    desc: 'Сервер виконав GET-запит до ресурсу, і відповідь є результатом однієї або декількох маніпуляцій над поточним екземпляром.',
  },

  // 3xx Перенаправлення

  300: {
    error: 'Multiple Choices',
    desc: 'Вказує на декілька варіантів ресурсу, які клієнт може вибрати.',
  },
  301: {
    error: 'Moved Permanently',
    desc: 'Цей та всі майбутні запити повинні бути спрямовані на вказаний URI.',
  },
  302: {
    error: 'Found',
    desc: 'Клієнту слід перейти за іншим URL.',
  },
  303: {
    error: 'See Other',
    desc: 'Відповідь на запит можна знайти за іншим URI за допомогою методу GET.',
  },
  304: {
    error: 'Not Modified',
    desc: 'Ресурс не змінювався з моменту, зазначеного у заголовках запиту.',
  },
  305: {
    error: 'Use Proxy',
    desc: 'Запитуваний ресурс доступний лише через проксі, адресу якого вказано у відповіді.',
  },
  306: {
    error: 'Switch Proxy',
    desc: 'Більше не використовується. Спочатку означав "Наступні запити повинні використовувати вказаний проксі".',
  },
  307: {
    error: 'Temporary Redirect',
    desc: 'Інструктує клієнта повторити запит за іншим URI.',
  },
  308: {
    error: 'Permanent Redirect',
    desc: 'Запит і всі майбутні запити повинні повторюватися за іншим URI.',
  },

  // 4xx Помилка клієнта

  400: {
    error: 'Bad Request',
    desc: 'Сервер відхилив запит через помилку клієнта (неправильний синтаксис, великий розмір, некоректне повідомлення або оманливий маршрут запиту).',
  },
  401: {
    error: 'Unauthorized',
    desc: 'Потрібна автентифікація, яка не вдалася або ще не була надана.',
  },
  402: {
    error: 'Payment Required',
    desc: 'Зарезервовано для майбутнього використання. Призначено для цифрових платіжних систем.',
  },
  403: {
    error: 'Forbidden',
    desc: 'Запит був коректним, але сервер відмовляється виконувати дію за відсутністю прав доступу.',
  },
  404: {
    error: 'Not Found',
    desc: 'Запитуваний ресурс не знайдено, але може бути доступний у майбутньому.',
  },
  405: {
    error: 'Method Not Allowed',
    desc: 'Метод запиту не підтримується для запитуваного ресурсу.',
  },
  406: {
    error: 'Not Acceptable',
    desc: 'Запитуваний ресурс може генерувати лише контент, який не приймається згідно з заголовками Accept у запиті.',
  },
  407: {
    error: 'Proxy Authentication Required',
    desc: 'Клієнт повинен спочатку автентифікуватися через проксі.',
  },
  408: {
    error: 'Request Timeout',
    desc: 'Сервер очікував на запит занадто довго.',
  },
  409: {
    error: 'Conflict',
    desc: 'Запит не може бути оброблений через конфлікт, наприклад, конфлікт редагування.',
  },
  410: {
    error: 'Gone',
    desc: 'Запитуваний ресурс більше недоступний і не буде доступний знову.',
  },
  411: {
    error: 'Length Required',
    desc: 'Запит не містить довжини контенту, яка потрібна для запитуваного ресурсу.',
  },
  412: {
    error: 'Precondition Failed',
    desc: 'Сервер не відповідає одній з попередніх умов, встановлених клієнтом у запиті.',
  },
  413: {
    error: 'Payload Too Large',
    desc: 'Запит більший, ніж сервер готовий або може обробити.',
  },
  414: {
    error: 'URI Too Long',
    desc: 'Наданий URI занадто довгий для обробки сервером.',
  },
  415: {
    error: 'Unsupported Media Type',
    desc: 'Тип медіа-запиту не підтримується сервером або ресурсом.',
  },
  416: {
    error: 'Range Not Satisfiable',
    desc: 'Клієнт запросив частину файлу, але сервер не може надати цю частину.',
  },
  417: {
    error: 'Expectation Failed',
    desc: 'Сервер не може виконати вимоги заголовка Expect у запиті.',
  },
  418: {
    error: "I'm a teapot",
    desc: 'Цей код був визначений у 1998 році як жарт IETF до Дня дурня. Не очікується, що буде реалізований реальними HTTP-серверами.',
  },
  421: {
    error: 'Misdirected Request',
    desc: 'Запит був спрямований на сервер, який не може надати відповідь.',
  },
  422: {
    error: 'Unprocessable Entity',
    desc: 'Запит був коректним, але не може бути виконаний через семантичні помилки.',
  },
  423: {
    error: 'Locked',
    desc: 'Ресурс, до якого здійснюється доступ, заблокований.',
  },
  424: {
    error: 'Failed Dependency',
    desc: 'Запит не виконано через невдачу попереднього запиту.',
  },
  425: {
    error: 'Too Early',
    desc: 'Сервер не бажає ризикувати обробкою запиту, який може бути повторно відправлений.',
  },
  426: {
    error: 'Upgrade Required',
    desc: 'Клієнт повинен перейти на інший протокол, наприклад TLS/1.0.',
  },
  427: {
    error: 'Unassigned',
    desc: 'Цей код статусу не призначений.',
  },
  428: {
    error: 'Precondition Required',
    desc: 'Сервер вимагає, щоб запит був умовним.',
  },
  429: {
    error: 'Too Many Requests',
    desc: 'Користувач надіслав занадто багато запитів за певний проміжок часу ("ліміт запитів").',
  },
  430: {
    error: 'Unassigned',
    desc: 'Цей код статусу не призначений.',
  },
  431: {
    error: 'Request Header Fields Too Large',
    desc: 'Сервер не бажає обробляти запит через занадто великі поля заголовків.',
  },
  451: {
    error: 'Unavailable For Legal Reasons',
    desc: 'Сервер відмовляє у доступі до ресурсу через юридичні вимоги.',
  },

  // 5xx Помилка сервера

  500: {
    error: 'Internal Server Error',
    desc: 'Загальне повідомлення про помилку, коли немає більш конкретного повідомлення.',
  },
  501: {
    error: 'Not Implemented',
    desc: 'Сервер або не розпізнає метод запиту, або не має можливості його виконати.',
  },
  502: {
    error: 'Bad Gateway',
    desc: 'Сервер був шлюзом або проксі і отримав некоректну відповідь від upstream-сервера.',
  },
  503: {
    error: 'Service Unavailable',
    desc: 'Сервер наразі недоступний (перевантажений або на технічному обслуговуванні).',
  },
  504: {
    error: 'Gateway Timeout',
    desc: 'Сервер був шлюзом або проксі і не отримав своєчасної відповіді від upstream-сервера.',
  },
  505: {
    error: 'HTTP Version Not Supported',
    desc: 'Сервер не підтримує версію HTTP-протоколу, використану у запиті.',
  },
  506: {
    error: 'Variant Also Negotiates',
    desc: 'Прозоре узгодження контенту для запиту призводить до циклічного посилання.',
  },
  507: {
    error: 'Insufficient Storage',
    desc: 'Сервер не може зберегти представлення, необхідне для виконання запиту.',
  },
  508: {
    error: 'Loop Detected',
    desc: 'Сервер виявив нескінченний цикл під час обробки запиту.',
  },
  509: {
    error: 'Bandwidth Limit Exceeded',
    desc: 'Цей код статусу не визначений у RFC, але використовується деякими серверами.',
  },
  510: {
    error: 'Not Extended',
    desc: 'Для виконання запиту потрібні додаткові розширення.',
  },
  511: {
    error: 'Network Authentication Required',
    desc: 'Клієнт повинен пройти автентифікацію для доступу до мережі.',
  }
};
